{"format": "layers-model", "generatedBy": "keras v3.7.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.7.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 200, 200, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 15, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 200, 200, 3]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of39.bin", "group1-shard2of39.bin", "group1-shard3of39.bin", "group1-shard4of39.bin", "group1-shard5of39.bin", "group1-shard6of39.bin", "group1-shard7of39.bin", "group1-shard8of39.bin", "group1-shard9of39.bin", "group1-shard10of39.bin", "group1-shard11of39.bin", "group1-shard12of39.bin", "group1-shard13of39.bin", "group1-shard14of39.bin", "group1-shard15of39.bin", "group1-shard16of39.bin", "group1-shard17of39.bin", "group1-shard18of39.bin", "group1-shard19of39.bin", "group1-shard20of39.bin", "group1-shard21of39.bin", "group1-shard22of39.bin", "group1-shard23of39.bin", "group1-shard24of39.bin", "group1-shard25of39.bin", "group1-shard26of39.bin", "group1-shard27of39.bin", "group1-shard28of39.bin", "group1-shard29of39.bin", "group1-shard30of39.bin", "group1-shard31of39.bin", "group1-shard32of39.bin", "group1-shard33of39.bin", "group1-shard34of39.bin", "group1-shard35of39.bin", "group1-shard36of39.bin", "group1-shard37of39.bin", "group1-shard38of39.bin", "group1-shard39of39.bin"], "weights": [{"name": "sequential/conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "sequential/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [313632, 128], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/dense_2/kernel", "shape": [128, 15], "dtype": "float32"}, {"name": "sequential/dense_2/bias", "shape": [15], "dtype": "float32"}]}]}